GAULAvionique2024-2025/Ordinateur-de-bord/ODB_V3/Software/STM32CubeIDE/ODBlix/Core/Src/App/tasks.c
/*
 * tasks.c
 *
 *  Created on: 10 mai 2026
 *      Author: gagno
 */


#include "App/tasks.h"
#include "stm32f4xx_hal.h"
#include "App/flight_fsm.h"
#include "App/logger.h"
#include "App/scheduler.h"
#include "GAUL_Drivers/system.h"


extern odb_data_t flight_data;
extern nexus_t nexus;
extern hm11_t hm11;
extern rfd900x_t rfd900x;


void Task_ExecuteFsm(void) {
    FSM_Update();
}

void Task_UpdateData(void) {
    ODB_Update(&flight_data);
    Logger_PushData(&flight_data);
}

void Task_Logger(void) {
    Logger_Task();
}

void Task_Telemetry(void) {
    if((flight_data.system_states & FLAG_RADIO_OK) == 0U) return;
    Telemetry_SendRocketData(&rfd900x, ODB_MODEM_BOOSTER, &flight_data, HAL_GetTick());
}

void Task_BluetoothRx(void) {
    if((flight_data.system_states & FLAG_BT_OK) == 0U) return;
    App_HandleCommands(&nexus, &hm11);
}

void Task_BluetoothTx(void) {
    static uint32_t last_frame_ms = 0U;
    const uint32_t current_ms = HAL_GetTick();
    if((flight_data.system_states & FLAG_BT_OK) == 0U) return;
    if(!nexus.is_enabled) return;

    if((current_ms - last_frame_ms) >= TASK_BLUETOOTH_FRAME_PERIOD_MS) {
        App_SendFrame(&nexus, &hm11, &flight_data);
        last_frame_ms = current_ms;
    }
}

void Tasks_Init(void) {
    Scheduler_Init();
    Scheduler_AddTask(Task_ExecuteFsm, TASK_FSM_PERIOD_MS);
    Scheduler_AddTask(Task_UpdateData, TASK_DATA_UPDATE_PERIOD_MS);
    Scheduler_AddTask(Task_Logger, TASK_LOGGER_PERIOD_MS);
    Scheduler_AddTask(Task_Telemetry, TASK_TELEMETRY_PERIOD_MS);
    Scheduler_AddTask(Task_BluetoothRx, TASK_BLUETOOTH_RX_PERIOD_MS);
    Scheduler_AddTask(Task_BluetoothTx, TASK_BLUETOOTH_FRAME_PERIOD_MS);

    Logger_Init();
}
